FemDesign.Loads.ModelGeneralLoadGroup
load_case (child of load_group_table)

FemDesign.Loads.ModelGeneralLoadGroup.#ctor
parameterless constructor for serialization

FemDesign.Loads.ModelGeneralLoadGroup.#ctor(FemDesign.Loads.LoadGroupBase)
Public constructor
LoadGroup: Specific load group object

FemDesign.Loads.ModelGeneralLoadGroup.GetLoadCases
Gets the load cases of the specific load group that the general load group owns
Returns: List of load cases

FemDesign.Loads.ModelGeneralLoadGroup.GetLoadCaseGuidsAsString
Get LoadCase guids of LoadCases in LoadCombination.
Returns: List of load case guids

FemDesign.Loads.ModelGeneralLoadGroup.GetLoadGroupType
Gets the load group type of the specific load group that the general load group owns
Returns: The type pf the load group

FemDesign.Loads.ModelGeneralLoadGroup.AddSpecificLoadGroup(FemDesign.Loads.LoadGroupBase,System.Boolean)
Assignes the load group to the correct field depending on its type
loadGroup: A specific load group instance, derived from LoadGroupBase
replaceExisting: True if the general load group already contains a specific load group

FemDesign.Loads.ModelGeneralLoadGroup.GetSpecificLoadGroup
Gets the specific load group from one of the general load groups fields
Returns: